Revit 2026 API

# FreeFormElementUpdateSolidGeometry Method

---

Updates the geometry of the FreeForm element to the given shape preserving References to the existing geometry where possible (see remarks for rules).

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void UpdateSolidGeometry(
	Solid newGeometry
)
```
```vb
Public Sub UpdateSolidGeometry (
	newGeometry As Solid
)
```
```cpp
public:
void UpdateSolidGeometry(
	Solid^ newGeometry
)
```
```fsharp
member UpdateSolidGeometry :
        newGeometry : Solid -> unit
```

#### Parameters

newGeometry Solid
     The new geometry to set in the FreeForm element.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

Rules for preserving References:

  * First preserve faces as Reference when exclusively coincident with existing faces.
  * Then preserve faces as Reference if exclusively parallel to existing faces.
  * Then preserve faces as Reference if exclusive at small angle to the existing faces.
  * Any other faces are will not be preserved as a Reference.

Edges are preserved as References if and only if exclusively bound to faces that are also preserved as References.

#### Reference

FreeFormElement Class

Autodesk.Revit.DB Namespace